index.html?wsdl

<?xml version='1.0' encoding='UTF-8'?>
<wsdl:definitions xmlns:plink="http://schemas.xmlsoap.org/ws/2003/05/partner-link/" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:soap11enc="http://schemas.xmlsoap.org/soap/encoding/" xmlns:soap11env="http://schemas.xmlsoap.org/soap/envelope/" xmlns:soap12enc="http://www.w3.org/2003/05/soap-encoding" xmlns:soap12env="http://www.w3.org/2003/05/soap-envelope" xmlns:tns="spyne.examples.hello.http" xmlns:wsa="http://schemas.xmlsoap.org/ws/2003/03/addressing" xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" xmlns:xop="http://www.w3.org/2004/08/xop/include" xmlns:xs="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" targetNamespace="spyne.examples.hello.http" name="Application"><wsdl:types><xs:schema targetNamespace="spyne.examples.hello.http" elementFormDefault="qualified"><xs:complexType name="say_hello"><xs:sequence><xs:element name="name" type="xs:string" minOccurs="0" nillable="true"/><xs:element name="times" type="xs:nonNegativeInteger" minOccurs="0" nillable="true"/></xs:sequence></xs:complexType><xs:complexType name="say_helloResponse"><xs:sequence><xs:element name="say_helloResult" type="xs:string" minOccurs="0" nillable="true"/></xs:sequence></xs:complexType><xs:element name="say_hello" type="tns:say_hello"/><xs:element name="say_helloResponse" type="tns:say_helloResponse"/></xs:schema></wsdl:types><wsdl:message name="say_hello"><wsdl:part name="say_hello" element="tns:say_hello"/></wsdl:message><wsdl:message name="say_helloResponse"><wsdl:part name="say_helloResponse" element="tns:say_helloResponse"/></wsdl:message><wsdl:service name="HelloWorldService"><wsdl:port name="Application" binding="tns:Application"><soap:address location="http://47.100.170.38:7789/"/></wsdl:port></wsdl:service><wsdl:portType name="Application"><wsdl:operation name="say_hello" parameterOrder="say_hello"><wsdl:input name="say_hello" message="tns:say_hello"/><wsdl:output name="say_helloResponse" message="tns:say_helloResponse"/></wsdl:operation></wsdl:portType><wsdl:binding name="Application" type="tns:Application"><soap:binding style="document" transport="http://schemas.xmlsoap.org/soap/http"/><wsdl:operation name="say_hello"><soap:operation soapAction="say_hello" style="document"/><wsdl:input name="say_hello"><soap:body use="literal"/></wsdl:input><wsdl:output name="say_helloResponse"><soap:body use="literal"/></wsdl:output></wsdl:operation></wsdl:binding></wsdl:definitions>